"""Задание 3

Даны такие списки:

students = ['Ivanov', 'Petrov', 'Sidorov']

subjects = ['math', 'biology', 'geography']

Распечатайте текст, который будет использовать данные из этих списков. Текст в итоге должен выглядеть так:

Students Ivanov, Petrov, Sidorov study these subjects: math, biology, geography"""

students = ['Ivanov', 'Petrov', 'Sidorov']

subjects = ['math', 'biology', 'geography']

print(
    f"Student {students[0]}, {students[1]}, {students[2]} study these subjects: {subjects[0]}, {subjects[1]}, {subjects[2]}")
