# Задача по обработке чисел
# Условие - Даны 2 числа a и b. Получить их сумму, разность и произведение

number_a = int(input("Введите число a: "))
number_b = int(input("Введите число b: "))

print(f"Результат: {number_a + number_b}")
print(f"Результат: {number_a - number_b}")
print(f"Результат: {number_a * number_b}")
